public class BubbleSort{
	public static void main(String[] args){
		int arr[] = {24, 69, 80, 57, 13, 22, 108};
		//½«Îå¸öÎÞÐò£º24,69,80,57,13 
		//Ê¹ÓÃÃ°ÅÝÅÅÐò·¨½«ÆäÅÅ³ÉÒ»¸ö´ÓÐ¡µ½´óµÄÓÐÐòÊýÁÐ¡£
		/*
		 µÚ 1 ÂÖÅÅÐò: Ä¿±ê°Ñ×î´óÊý·ÅÔÚ×îºó
		 µÚ 1 ´Î±È½Ï[24,69,80,57,13]
		 µÚ 2 ´Î±È½Ï[24,69,80,57,13]
		 µÚ 3 ´Î±È½Ï[24,69,57,80,13]
		 µÚ 4 ´Î±È½Ï[24,69,57,13,80]
		 Òª½øÐÐËÄÂÖÅÅÐò£¬±È½Ï´ÎÊýÒÀ´ÎµÝ¼õ
		*/
		int temp = 0;//½»»»±äÁ¿
		for(int i = 0; i < arr.length - 1; i++){//Íâ²ãÑ­»·

		for(int j = 0; j < arr.length - 1; j++){//ÄÚ²ãÑ­»·±È½Ï
			if(arr[j] > arr[j+1]){
				temp = arr[j];		//½»»»
				arr[j] = arr[j+1];
				arr[j+1] = temp;
			}
		}
	}
		for(int j = 0; j < arr.length; j++){
			System.out.print(arr[j] + " ");
		}
	
	}
}